Autodesk.Revit.DB.GuidEnum.GetHashCode
Generates a hash code for this Guid-based enum object.

Autodesk.Revit.DB.GuidEnum.Equals(System.Object)
Compares two Guid-based enum object based on their concrete class and GUID value.

Autodesk.Revit.DB.GuidEnum.Guid
The Guid of GUID-based enum object.

Autodesk.Revit.DB.GuidEnum.#ctor(System.Guid)
Creates an Guid-based enum instance with the supplied name and GUID.
GUID-based enum instance can be compared by this guid value.
guid:  The GUID of this GUID-based enum.

Autodesk.Revit.DB.GuidEnum
Base class of all GUID-based enum classes.